app/Http/Livewire/Forms/CategoryForm.php

select `id`, `name` from `categories`
---
    public function render()
    {
        $categories = Category::select('id','name')->get();