app/Http/Livewire/Forms/ElementForm.php

    public function render()
    {
        $categories = Category::select('id','name')->get();
---
select `id`, `name` from `categories`

    public  function save()
    {
        $validated =  $this->validate();

        if ($this->element){
            $this->element->update($validated);
            $this->emit('alert',
                ['type' => 'info',  'message' => 'Element Updated Successfully!']);
        }else{
            if (Element::where('name',$this->name)->exists()){
---
select exists(select * from `elements` where `name` = 'Amy Maxwell') as `exists`