app/Http/Livewire/Forms/ItemsForm.php

select `id`, `name` from `elements`
---
    public function render()
    {

        return view('livewire.forms.items-form',[
            'elements' => Element::select('id','name')->get()
        ]);