app/Http/Livewire/Forms/ItemsInsert.php

    public function mount()
    {
        $this->elements = Element::select('id','name')->get();
---
select `id`, `name` from `elements`