app/Http/Livewire/Tables/CategoriesTable.php

    public function render()
    {
        return view('livewire.tables.categories-table', [
            'categories' => Category::search($this->search)
                ->with('parent')
                //    ->whereHas("roles", function($q){ $q->whereNotIn("name", ["seller"]); })
                ->orderBy($this->orderBy, $this->orderAsc ? 'asc' : 'desc')
                ->paginate($this->perPage),
        ]);
---
select * from `categories` order by `id` asc limit 10 offset 0
select count(*) as aggregate from `categories`