app/Http/Livewire/Tables/ElementsTable.php

    public function render()
    {
        return view('livewire.tables.elements-table',[
            'elements' => Element::search($this->search)
                ->with('category')
                //    ->whereHas("roles", function($q){ $q->whereNotIn("name", ["seller"]); })
                ->orderBy($this->orderBy, $this->orderDesc ? 'desc' : 'asc')
                ->paginate($this->perPage),
        ]);
---
select * from `elements` order by `id` asc limit 10 offset 0
select count(*) as aggregate from `elements`
select * from `categories` where `categories`.`id` in (5, 6, 7, 15, 25, 30, 31, 39, 49)