app/Http/Livewire/Tables/FormulasTable.php

    public function render()
    {
        return view('livewire.tables.formulas-table',[
            'formulas' => Formula::search($this->search)
                ->with('category')
                //    ->whereHas("roles", function($q){ $q->whereNotIn("name", ["seller"]); })
                ->orderBy($this->orderBy, $this->orderDesc ? 'desc' : 'asc')
                ->paginate($this->perPage),
        ]);
---
select * from `formulas` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `formulas`
select * from `categories` where `categories`.`id` in (7)