app/Http/Livewire/Tables/InventoryTable.php

    public function render()
    {
        return view('livewire.tables.inventory-table',[
            'items' =>Item::search($this->search)
            ->whereHas('inventory' ,function($q){
                $q->where('id',1);
            })->with('element')
            ->orderBy($this->orderBy, $this->orderAsc ? 'asc' : 'desc')
            ->paginate($this->perPage)
        ]);
---
select * from `elements` where `elements`.`id` in (1, 2)
select * from `items` where exists (select * from `inventories` where `items`.`inventory_id` = `inventories`.`id` and `id` = 1) order by `id` asc limit 10 offset 0
select count(*) as aggregate from `items` where exists (select * from `inventories` where `items`.`inventory_id` = `inventories`.`id` and `id` = 1)