app/Http/Livewire/Tables/UsersTable.php

select * from `users` order by `id` asc limit 10 offset 0
select count(*) as aggregate from `users`
---
    public function render()
    {
        return view('livewire.tables.users-table', [
            'users' => User::search($this->search)
                ->with('roles')
            //    ->whereHas("roles", function($q){ $q->whereNotIn("name", ["seller"]); })
                ->orderBy($this->orderBy, $this->orderAsc ? 'asc' : 'desc')
                ->paginate($this->perPage),
        ]);