app/Http/Controllers/InventoryController.php

    public function index()
    {
        $items = Item::whereHas('inventory' ,function($q){
        $q->where('id',1);
    })->with('element')->get();
---
select * from `inventories` limit 1
select * from `elements` where `elements`.`id` in (1, 2)
select * from `items` where exists (select * from `inventories` where `items`.`inventory_id` = `inventories`.`id` and `id` = 1)