app/Http/Controllers/RolesController.php

select * from `roles` where `name` not in ('client') order by `id` desc limit 5 offset 0
select count(*) as aggregate from `roles` where `name` not in ('client')
---
    public function index(Request $request)
    {
        //
        $roles = Role::whereNotIn('name', ['client'])->orderBy('id','DESC')->paginate(5);

select `role_has_permissions`.`permission_id`, `role_has_permissions`.`permission_id` from `role_has_permissions` where `role_has_permissions`.`role_id` = '3'
---
    public function edit($id)
    {
        //
        $role = Role::findById($id);
        $permissions = Permission::get();
        $rolePermissions =Db::table("role_has_permissions")->where('role_has_permissions.role_id',$id)->pluck('role_has_permissions.permission_id','role_has_permissions.permission_id')->all();