app/Http/Controllers/UsersController.php

    public function index( )
    {
        $users = User::with(['roles'=>fn($q)=>$q->select('id','name')])->orderBy('id','DESC')->paginate(5);
---
select count(*) as aggregate from `users`

    public function show(int $id)
    {
        $user = User::findOrFail($id);
        $userRole = DB::table('roles')->where('id',$user->role)->get();

        if(! $user->hasAnyRole(Role::all())) {
---
select * from `roles` where `id` is null
select * from `roles`